backend/controllers/SiteController.php

SELECT * FROM `item_prod` WHERE (`estatusNotificacion`='Vencido') AND (`estatusItemProd`='Active')
SELECT * FROM `item_prod` WHERE (`estatusNotificacion`='Por Vencer') AND (`estatusItemProd`='Active')
---
    public function actionIndex()
    {


  $mostrarVencer=ItemProd::find()->where(['estatusNotificacion'=>'Vencido','estatusItemProd' =>'Active'])->all();
 $mostrarPorExpirar=ItemProd::find()->where(['estatusNotificacion'=>'Por Vencer','estatusItemProd' =>'Active'])->all();