backend/controllers/UserController.php

     public function actionRestore($id)
    {



        $session = Yii::$app->session;
          if (isset($session['user'])){

        $msg=null;
        $model=ChangePass::find()->where(['id'=>$id])->one();
        //$model = $this->findModel($id);
        $user=Yii::$app->user->identity->username;
        //$oldpassword=$model->oldpassword;



        if ($model->load(Yii::$app->request->post()) && $model->validate()) {


        $change =UserSearch::findOne(["username" => $user, "id" => $id]);


        if ($change) {
            if ($model->validatePassword($model->oldpassword)) {
            $change->setPassword($model->password);


            if ($change->save())
---
SELECT * FROM `user` WHERE (`username`='@AbbyLobato') AND (`id`='1')
UPDATE `user` SET `password_hash`='$2y$13$N.WcZ0lchXw.K2IjoAgkhebwVlxLFFovwy3KjoCyMq2.WEyHwQI32' WHERE `id`=1