backend/views/compras/_form.php


                ]); ?-->

     <?= $form->field($model, 'Proveedores_idproveedor')->dropDownList(
                ArrayHelper::map(Proveedores::find()->where(['estatusproveedor' => 'Active'])->all(),'idproveedor','nomproveedor'),

                [
                    'prompt'=>'Seleccione el Proveedor.',
                    'onchange'=>
                    '$.post( "index.php?r=Proveedor/lists?id='.'"+$(this).val(), function( data ) {
                    $( "select#models" ).html( data );
                });'

                ]); ?>
---
SELECT * FROM `proveedores` WHERE `estatusproveedor`='Active'

                        <div class="row">

                             <div class="col-sm-6">
                                <?= $form->field($modelsItemProd, "[{$i}]Producto_idProducto")->dropDownList(
                                        ArrayHelper::map(Producto::find()->where(['estatusProducto' =>'Active'])->all(),'idProducto','nombresw'),
                                        [
                                            'prompt'=>'Seleccione el Producto.',
                                            'onchange'=>
                                            '$.post( "index.php?r=Producto/lists&id='.'"+$(this).val(), function( data ) {
                                            $( "select#models-contact" ).html( data );
                                        });'

                                        ]); ?>
---
SELECT * FROM `producto` WHERE `estatusProducto`='Active'